#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Plan 📖`success`

Show Plan

```terraform

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # local_file.inventory_tmpl will be created
  + resource "local_file" "inventory_tmpl" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../configuring/inventory"
      + id                   = (known after apply)
    }

  # yandex_compute_instance.k8smaster will be created
  + resource "yandex_compute_instance" "k8smaster" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = "ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDLc9h3DFb2ZWKDP/mS7GBA5JT5Da3Pd3zfoMgrHoaA7WkJkHfysJa6JeW+apSi+ob9bEcAJjK+DEzaPKltiVvIwwGD5ip7d/UOEJgodi1PVQsYusjt81/zUi8+UT308Izi4y1DxQhm3zIJI2R11Nk5iA1hZa7WuZFFxfocYVCirv/tqOHEwZwgGW7Qc4Qb/wyOYtERkK47pAsI05QrkMiiWdEfQlkfP8GquEBpjDmxSWE5/bc/w4tRUWAEIIv45RKiuY77ODJfAZMfLgphmuz5rrIdO9DvO74rkM41LAJUJG+h5HicZprUdef83AAIJTB7iZw2GWZYHw5Aiw3EAEfDHYloyWKT1ZgenhfbW/BBGmxm+SBOzyYIYrP9o67ut41PKXHnctlIZAIAq0DQ5eE9e9njWDVi/sXWsP52MGVmihRYtM/dGlv3PfY4VxfVLIN3iGWwdLnA7rgOBi7Ztw+fXGg0Yv63me4OWhGbvFXPdUy1a79XxMRjfzz+oRE2FHk= root@st17-HP-EliteDesk-800-G1-SFF"
        }
      + name                      = "k8smaster"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8s78up10fbjbe5atn7"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 5
          + cores         = 2
          + memory        = 4
        }
    }

  # yandex_compute_instance.k8sworker will be created
  + resource "yandex_compute_instance" "k8sworker" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = "ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDLc9h3DFb2ZWKDP/mS7GBA5JT5Da3Pd3zfoMgrHoaA7WkJkHfysJa6JeW+apSi+ob9bEcAJjK+DEzaPKltiVvIwwGD5ip7d/UOEJgodi1PVQsYusjt81/zUi8+UT308Izi4y1DxQhm3zIJI2R11Nk5iA1hZa7WuZFFxfocYVCirv/tqOHEwZwgGW7Qc4Qb/wyOYtERkK47pAsI05QrkMiiWdEfQlkfP8GquEBpjDmxSWE5/bc/w4tRUWAEIIv45RKiuY77ODJfAZMfLgphmuz5rrIdO9DvO74rkM41LAJUJG+h5HicZprUdef83AAIJTB7iZw2GWZYHw5Aiw3EAEfDHYloyWKT1ZgenhfbW/BBGmxm+SBOzyYIYrP9o67ut41PKXHnctlIZAIAq0DQ5eE9e9njWDVi/sXWsP52MGVmihRYtM/dGlv3PfY4VxfVLIN3iGWwdLnA7rgOBi7Ztw+fXGg0Yv63me4OWhGbvFXPdUy1a79XxMRjfzz+oRE2FHk= root@st17-HP-EliteDesk-800-G1-SFF"
        }
      + name                      = "k8sworker"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8s78up10fbjbe5atn7"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 5
          + cores         = 2
          + memory        = 4
        }
    }

  # yandex_compute_instance.sonarqube will be created
  + resource "yandex_compute_instance" "sonarqube" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = "ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDLc9h3DFb2ZWKDP/mS7GBA5JT5Da3Pd3zfoMgrHoaA7WkJkHfysJa6JeW+apSi+ob9bEcAJjK+DEzaPKltiVvIwwGD5ip7d/UOEJgodi1PVQsYusjt81/zUi8+UT308Izi4y1DxQhm3zIJI2R11Nk5iA1hZa7WuZFFxfocYVCirv/tqOHEwZwgGW7Qc4Qb/wyOYtERkK47pAsI05QrkMiiWdEfQlkfP8GquEBpjDmxSWE5/bc/w4tRUWAEIIv45RKiuY77ODJfAZMfLgphmuz5rrIdO9DvO74rkM41LAJUJG+h5HicZprUdef83AAIJTB7iZw2GWZYHw5Aiw3EAEfDHYloyWKT1ZgenhfbW/BBGmxm+SBOzyYIYrP9o67ut41PKXHnctlIZAIAq0DQ5eE9e9njWDVi/sXWsP52MGVmihRYtM/dGlv3PfY4VxfVLIN3iGWwdLnA7rgOBi7Ztw+fXGg0Yv63me4OWhGbvFXPdUy1a79XxMRjfzz+oRE2FHk= root@st17-HP-EliteDesk-800-G1-SFF"
        }
      + name                      = "sonarqube"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8s78up10fbjbe5atn7"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 5
          + cores         = 4
          + memory        = 4
        }
    }

  # yandex_vpc_network.network-1 will be created
  + resource "yandex_vpc_network" "network-1" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "from-terraform-network"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet-1 will be created
  + resource "yandex_vpc_subnet" "subnet-1" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "from-final-project-subnet"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.2.0.0/16",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + external_ip_address_k8smaster = (known after apply)
  + external_ip_address_k8sworker = (known after apply)
  + external_ip_address_sonarqube = (known after apply)
  + internal_ip_address_k8smaster = (known after apply)
  + internal_ip_address_k8sworker = (known after apply)
  + internal_ip_address_sonarqube = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"
```



*Pusher: @hasan2001jk, Action: `pull_request`, Workflow: `Pull Request Master`*